SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( 5055

Comment ( ***Wagon Section*** )

Comment ( ** Based on Castle Class locomotive with HC medium superheat boiler ** )

Comment ( ******************** General Information **********************
             Included in this section - Type, Shape, Size, Mass, etc
         *************************************************************** )

 Type ( Engine )
 WagonShape ( 5055.s )
 Size ( 2.696m 4.045m 11.45m )
 Mass ( 79.85t-uk )
	WheelRadius ( 18.0in )
	NumWheels ( 2 )

Comment ( ************************* Coupler Information ************************
                Included in this section - Type, Spring, Buffer, Velocity, etc
         ********************************************************************** )

Comment ( Rear Coupler )
   Coupling ( Spring ( 	Stiffness ( 1e4N/m 4.5e6N/m )
			Break ( 1200kN 1200kN )
			r0 ( 1cm 10cm ) )
	      CouplingHasRigidConnection ( 1 ))

Comment ( Front Coupler )
   Coupling ( Spring (
			Stiffness ( 1e4N/m 4.5e6N/m )
			Break ( 1200kN 1200kN )
			r0 ( 0cm 70cm )))

Comment ( ******************************* Brakes *********************************************
             Included in this section - Type, Force, Reservoir, Applicatiion, Release, etc
         ************************************************************************************ )

    BrakeEquipmentType( Vacuum_brake, Auxilary_reservoir )
    BrakeSystemType( Vacuum_single_pipe )
    MaxBrakeForce( 200kN )

    ORTSNumberBrakeCylinders ( 2 ) 
    Comment ( Large GWR 4-6-0 has 1 x 30in cylinder with 9in stroke )
    Comment ( OpenRails assumes 4.5in stroke so this is set as two cylinders )
    ORTSBrakeCylinderSize ( 30in )
    ORTSAuxilaryResCapacity ( 8.25ft^3 ) Comment ( Based on Phillipson 16.5ft^3 vacuum chamber for 30in x 9in vacuum cylinder )

    MaxReleaseRate ( 5.0InHg/s )
    MaxApplicationRate ( 2.0InHg/s )
    BrakeCylinderPressureForMaxBrakeBrakeForce ( 25InHg )
    BrakePipeVolume ( 0.93ft^3 )     

    ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)  Comment ( == Cast Iron Brakeshoes == )

Comment ( ******************* Resistance & SuperElevation ********
          Included in this section - Wheelbase, gauge, friction, etc
         ******************************************************** )

  ORTSBearingType ( Friction )
  ORTSDavis_A ( 3729 )
  ORTSDavis_B ( 112 )
  ORTSDavis_C ( 6.02 )

  ORTSWagonFrontalArea ( 96ft^2 ) Comment (* Estimate based on dimensions *)
  ORTSDavisDragConstant ( 0.0028 )
  ORTSTrailLocomotiveResistanceFactor ( 0.147 )

  CentreOfGravity ( 0m 2.374m 0m )
  ORTSTrackGauge ( 4ft 8.5in )
  ORTSUnbalancedSuperelevation ( 6in )
  ORTSRigidWheelbase ( 16ft 3in )
  

Comment ( ************************ Lights (If used) ***********************************
                Included in this section - Type, Colour, Location, Size, Control, etc
         ***************************************************************************** )

 Lights ( 17
  Light (
   Comment( lamp front right )
   Type ( 0 )
   Conditions (
    Headlight ( 3 )
     Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 80ffff70 )
     Position ( 0.974 1.491 5.663 )
     Azimuth ( 0.0 -5.0 5.0 )
     Transition ( 0 )
     Radius ( 0.4 )
    )
   )
  )
	Light (
   comment( Sphere of light for Exhaust )
    Type  ( 1 )
    Conditions (
    Headlight ( 3 )
    Unit ( 2 )
   )
    Cycle  ( 0 )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    States ( 1
            State (
      Duration ( 0.0 )
      LightColour ( 80ffe610 )
      Position ( 0 10.0 -12.0 )
      Transition ( 0 )
      Radius ( 6.0 )
      Angle ( 90.0 )
                 )
            )
    )
	Light (
   comment( Sphere of light for Exhaust )
    Type  ( 1 )
    Conditions (
    Headlight ( 3 )
    Unit ( 2 )
   )
    Cycle  ( 0 )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    States ( 1
            State (
      Duration ( 0.0 )
      LightColour ( 80ffe610 )
      Position ( 0 10.0 -13.50 )
      Transition ( 0 )
      Radius ( 6.0 )
      Angle ( 90.0 )
                 )
            )
    )



  Light (
   Comment( lamp front left )
   Type ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 80ffff70 )
     Position ( -0.974 1.491 5.663 )
     Azimuth ( 0.0 -5.0 5.0 )
     Transition ( 0 )
     Radius ( 0.4 )
    )
   )
  )
	 Light	(	
			comment( Gauge Glass Lamp A )
			Type( 0 )
			Conditions (
			Headlight ( 3 )
			Unit ( 2 )
			)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	( 1
			State	(
			Duration ( 0.0 )
			LightColour ( 80ff7200 )
			Position ( -0.2 3.4 -4.680 )
			Azimuth ( -180 -180 -180 )
			Transition ( 0 )
			Radius ( 0.15 )
					)
				)
			)
			Light	(	
			comment( Gauge Glass Lamp A )
			Type( 0 )
			Conditions (
			Headlight ( 3 )
			Unit ( 2 )
			)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	( 1
			State	(
			Duration ( 0.0 )
			LightColour ( 80ffe610 )
			Position ( -0.2 3.4 -4.680 )
			Azimuth ( -180 -180 -180 )
			Transition ( 0 )
			Radius ( 0.15 )
					)
				)
			)
					Light	(
			comment( Flickering firebox )
			Type		( 0 )
			Conditions	(
			Headlight ( 0 )
			Unit ( 0 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
			State	(
			Duration ( 0.5 )
			LightColour ( eeff8800 )
			Position ( 0 2.215 -4.680 )
			Azimuth ( -180 -180 -180 )
			Transition ( 0 )
			Radius ( 1.3 )
			)
			State	(
			Duration ( 0.3 )
			LightColour ( eeff8800 )
			Position ( 0 2.215 -4.680 )
			Azimuth ( -180 -180 -180 )
			Transition ( 0 )
			Radius ( 1.3 )
									
					)
					
				)
			)
			Light ( 
                  comment( Ashpan flashes ) 
			Type ( 0 ) 
			Conditions ( 
			Headlight ( 3 ) 
			Unit ( 0 ) 
			) 
			Cycle ( 0 ) 
			FadeIn ( 0 ) 
			FadeOut ( 0.5 ) 
			States ( 28 
			State ( 
			Duration ( 1 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.30 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 01.4 -4.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.4 -4.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.30 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.30 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.30 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.5 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -6.0 )
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 3 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 5 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -6.0 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.30 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.5 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
			) 
			State ( 
			Duration ( 0.6 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -4.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1 ) 
                  )
               )
          )
		Light ( 
                  comment( Chimney Sparks RS1AA ) 
			Type		( 0 )
			Conditions	(
			Headlight ( 3 )
			Unit ( 2 )
			TimeOfDay ( 0 )
			Weather ( 0 )
			Coupling ( 0 )  
			)
			Cycle ( 0 ) 
			FadeIn ( 0 ) 
			FadeOut ( 0.5 ) 
			States ( 28 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.66 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 4.22 3.66 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.42 3.66 )

			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.72 3.66 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.230 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 4.52 3.66 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 4.72 3.66 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.92 3.66 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.230 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 4.32 3.66 )
  
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.52 3.66 )
 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.92 3.66 )
 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.226 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.35 3.66 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.55 3.66 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.25 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.66 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.230 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 4.22 3.66 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 4.22 3.66 )
 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.66 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 7.22 3.66 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.66 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.66 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 00000000 ) 
			Position ( 0 5.22 3.66 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.66 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.225 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0 5.22 3.66 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.66 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.5 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.66 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.66 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.233 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.66 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.23 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.66 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.23 ) 
			) 
			State ( 
			Duration ( 0.6 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 9.22 3.66 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.230 ) 
                  )
               )
          )

		Light ( 
                  comment( Chimney Sparks RS1AA ) 
			Type		( 0 )
			Conditions	(
			Headlight ( 3 )
			Unit ( 2 )
			TimeOfDay ( 0 )
			Weather ( 0 )
			Coupling ( 0 )  
			)
			Cycle ( 0 ) 
			FadeIn ( 0 ) 
			FadeOut ( 0.5 ) 
			States ( 28 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.2 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.2 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.2 )

			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.2 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.2 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0 7.22 3.2 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.2 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.234 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.2 )
  
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.32 )
 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 7.22 3.32 )
 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.234 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 7.22 3.32 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.32 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.2235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.32 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.23 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.32 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 8.22 3.32 )
 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 7.22 3.32 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 00000000 ) 
			Position ( 0 9.22 3.32 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.32 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.2 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.236 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.32 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.2 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0 5.22 3.2 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.32 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.236 ) 
			) 
			State ( 
			Duration ( 0.5 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 7.22 3.32 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.236 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 7.22 3.32 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.32 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.32 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.236 ) 
			) 
			State ( 
			Duration ( 0.6 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 7.22 3.32 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.236 ) 
                  )
               )
          )

		Light ( 
                  comment( Chimney Sparks AA1 ) 
			Type		( 0 )
			Conditions	(
			Headlight ( 3 )
			Unit ( 2 )
			TimeOfDay ( 0 )
			Weather ( 0 )
			Coupling ( 0 )  
			)
			Cycle ( 0 ) 
			FadeIn ( 0 ) 
			FadeOut ( 0.5 ) 
			States ( 28 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 6.0 3.2 )
  
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.0 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 6.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.230 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.5 32 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 8.5 3.2 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.5 3.2 ) 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.23 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.5 3.2 ) 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 8.5 3.2 ) 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.5 3.2 ) 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.5 3.2 ) 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 6.5 3.2 ) 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.5 3.2 ) 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 8.5 3.2 ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.5 3.2 ) 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.5 3.2 ) 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 3 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 6.5 3.2 ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 8.5 3.2 ) 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 8.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( 80ff7200 )
			Position ( 0.0 6.5 3.2 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 6.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 8.5 3.2 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.5 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.5 3.2 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 6.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.6 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.0 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
                  )
               )
          )

		Light ( 
                  comment( Chimney Sparks AA ) 
			Type		( 0 )
			Conditions	(
			Headlight ( 3 )
			Unit ( 2 )
			TimeOfDay ( 0 )
			Weather ( 0 )
			Coupling ( 0 )  
			)
			Cycle ( 0 ) 
			FadeIn ( 0 ) 
			FadeOut ( 0.5 ) 
			States ( 28 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 5.5 3.2 )
  
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 5.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 5.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 5.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.236 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 5.5 3.2 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 5.5 3.2 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 5.5 3.2 ) 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 5.5 3.2 ) 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 5.5 3.2 ) 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 5.5 3.2 ) 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 5.5 3.2 ) 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 5.5 3.2 ) 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 5.5 3.2 ) 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 5.5 3.2 ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 5.5 3.2 ) 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 5.5 3.2 ) 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 3 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 5.5 3.2 ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.5 3.2 ) 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 6.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 6.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( 80ff7200 )
			Position ( 0.0 5.5 3.2 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 7.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 5.5 3.2 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.5 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 7.5 3.2 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.23 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 5.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 00000000 ) 
			Position ( 0.0 5.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 4.5 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.23 ) 
			) 
			State ( 
			Duration ( 0.6 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0.0 4.50 3.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.230 ) 
                  )
               )
          )

		Light	(
			comment( Flickering Ashpan Front )
			Type		( 0 )
			Conditions	(
			Headlight ( 3 )
			Unit ( 2 )
			)
			FadeIn	( 0.975 )
			FadeOut	( 0.975 )
			Cycle	( 0 )
			States	(	2
			State	(
			Duration ( 0.05 )
			LightColour ( 80ff7200 )
			Position ( -0 0.645 -1.502 )
			Azimuth ( -90 -90 -90 )
			Transition ( 0 )
			Radius ( 1.3 )
			)
			State	(
			Duration ( 0.05 )
			LightColour ( 80ff7200 )
			Position ( -0 0.62 -1.502 )
			Azimuth ( -180 -180 -180 )
			Transition ( 0 )
			Radius ( 1.3 )
							
					)
				)
			)

			Light	(
			comment( Flickering Ashpan Front )
			Type		( 0 )
			Conditions	(
			Headlight ( 0 )
			Unit ( 2 )
			)
			FadeIn	( 0.75 )
			FadeOut	( 0.75 )
			Cycle	( 0 )
			States	(	2
			State	(
			Duration ( 0.05 )
			LightColour ( 80ff7200 )
			Position ( -0 0.655 -1.502 )
			Azimuth ( 45 45 45 )
			Transition ( 0 )
			Radius ( 1.35 )
			)
			State	(
			Duration ( 0.05 )
			LightColour ( 80ff7200 )
			Position ( -0 0.655 -1.502 )
			Azimuth ( 180 180 180 )
			Transition ( 0 )
			Radius ( 1.35 )
									
					)
				)
			)

			Light	(
			comment( Flickering Ashpan Front )
			Type		( 0 )
			Conditions	(
			Headlight ( 3 )
			Unit ( 2 )
			)
			FadeIn	( 1.95 )
			FadeOut	( 1.95 )
			Cycle	( 0 )
			States	(	2
			State	(
			Duration ( 0.05 )
			LightColour ( 80ff7200 )
			Position ( -0 0.655 -1.502 )
			Azimuth ( 180 180 180 )
			Transition ( 0 )
			Radius ( 1.34 )
			)
			State	(
			Duration ( 0.05 )
			LightColour ( 80ff7200 )
			Position ( -0 0.655 -1.502 )
			Azimuth ( 180 180 180 )
			Transition ( 0 )
			Radius ( 1.34 )
									
					)
				)
			)

			Light	(
			comment( Flickering Ashpan Front Leading )
				Type		( 0 )
				Conditions	(
				Headlight ( 0 )
				Unit ( 2 )
				)
				FadeIn	( 1.5 )
				FadeOut	( 1.5 )
				Cycle		( 0 )
				States	(	2
				State	(
				Duration ( 0.05 )
				LightColour ( 80ff7200 )
				Position ( -0.0 0.652 -1.502 )
				Azimuth ( 0.0 -5.0 5.0 )
				Transition ( 0 )
				Radius ( 1.34 )
				Elevation ( -10 -10 -10 )
				)
				State	(
				Duration ( 0.05 )
				LightColour ( 80ff7200 )
				Position ( -0.0 0.652 -1.502 )
				Azimuth ( 0.0 -5.0 5.0 )
				Transition ( 0 )
				Radius ( 1.34 )
				Elevation ( -10 -10 -10 )
						)
				)
			)

			Light	(
			comment( Flickering Ashpan Back )
			Type		( 0 )
			Conditions	(
			Headlight ( 0 )
			Unit ( 0 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
			State	(
			Duration ( 0.05 )
			LightColour ( 80ff7200 )
			Position ( -0 0.643 -4.5 )
			Azimuth ( -180 -180 -180 )
			Transition ( 0 )
			Radius ( 1 )
			)
			State	(
			Duration ( 0.05 )
			LightColour ( 80ff7200 )
			Position ( -0 0.643 -4.5 )
			Azimuth ( -180 -180 -180 )
			Transition ( 0 )
			Radius ( 1 )
									
					)
				)
			)

		)

Comment ( ********************* Wagon Visual Effects ****************************
                      Included in this section - Effect type, etc
          *********************************************************************** )						
 	
Comment ( ************* Freight Freight and Load Animations (If used) ************
                Included in this section - Freight Animation information, etc
         ************************************************************************ )

	ORTSFreightAnims
	(
	MSTSFreightAnimEnabled(0)
	
	FreightAnimStatic
	(
		SubType ( Default )
		Shape(  .\\Headcodes\\Castle_headcode.s )
		Offset( 0.0, 0.0, 0.0 )
	)
	FreightAnimStatic
	(
		SubType ( Default )
		Shape( ..\\common.crew\\BA_1\\Black5.S )
		Offset( 0.0, 0.0, 0.20 )
	)	
)	

Comment ( ********************* Passenger View (If used) ******************
                Included in this section - File, Location, Direction, etc
         ***************************************************************** )

Comment ( ********************** Micellaneous Information **********
                      Included in this section - Name, Sounds, etc
          ********************************************************* )

Sound ("..\\..\\common.sound\\SteamSoundsOrgUk\\GWR-Manor-Ext-01.sms" )

Comment ( *****************  End Wagon Section ************************ ))


Engine ( 5055

Comment ( ************************** Engine Effects *******************
                      Included in this section - Steam emissions, etc
         ************************************************************* )

 Effects (
  SteamSpecialEffects (
   StackFX
   (     0 4.2 3.66
         0 1 0
         0.17 )
   SafetyValvesFX
   (    0 3.90 -0.27
        0 0.45 0
        0.3 )
   SafetyValvesFX
   (    0 4.1 -0.27
        0 1.2 0
        0.2 )
   WhistleFX
   (    0 4.08 -4.10
        0 0.8 0
        0.2 )

   CylindersFX
   (    1.10 0.62 3.0
        0.2 -0.3 1.75
        0.1 )
   Cylinders2FX
   (    1.10 0.60 2.98
        0.2 -0.3 1.75
        0.1 )
   CylindersFX
   (    -1.10 0.62 3.0
        -0.2 -0.3 1.75
        0.1 )
   Cylinders2FX
   (    -1.10 0.60 2.98
        -0.2 -0.3 1.75
        0.1 )

   CylindersFX
   (    0.18 0.58 5.6
        0.2 -0.3 1.75
        0.1 )
   Cylinders2FX
   (    0.18 0.56 5.58
        0.2 -0.3 1.75
        0.1 )
   CylindersFX
   (    -0.18 0.58 5.6
        -0.2 -0.3 1.75
        0.1 )
   Cylinders2FX
   (    -0.18 0.56 5.58
        -0.2 -0.3 1.75
        0.1 )
   Injectors1FX
    ( 1.00 0.34 -5.50
      0 -1 -1
      0.1 )
    Injectors2FX
     ( -1.00 0.34 -5.50
       0 -1 -1
       0.1 ) ) )


Comment ( ************************ General Information ****************
                Included in this section - Wheels, sanding, etc
          ************************************************************ )

 Comment ( * GWR Standard 8 HC boiler * )

 Wagon ( 5055 )
 Type ( Steam )
 ORTSSteamLocomotiveType ( Simple )
 WheelRadius ( 40.25in )
 NumWheels ( 3 )
 Sanding ( 20mph )
 ORTSDriveWheelWeight ( 58.85t-uk )

Comment ( ******************************* Boiler *********************************************
                      Included in this section - Length, volume, heating area, pressure, etc
          *********************************************************************************** )

    ORTSSteamBoilerType ( Superheated )
    BoilerVolume ( 381ft^3 )
    ORTSEvaporationArea ( 1963ft^2 )
    ORTSSuperheatArea ( 295ft^2 )
    MaxBoilerPressure ( 225psi )
    MaxSteamHeatingPressure( 80psi )
    
    ORTSMaxSuperheatTemperature ( 175 ) Comment ( estimate for GWR Standard 8 HC boiler )
    ORTSBoilerEvaporationRate ( 14.52 ) Comment( to give max steam rate 28500lb/hr with Markham coal ( 28500lb/h / ORTSEvaporationArea 1963ft^2 ) = 14.52  )
    ORTSBoilerEfficiency ( 0 0.91  90 0.68 )

Comment ( ***************************** Cylinders *******************************************
                      Included in this section - Number, Stroke, Diameter, steam usage, etc
          ********************************************************************************** )

    NumCylinders ( 4 )
    CylinderStroke ( 26in )
    CylinderDiameter ( 16in )
    
    ORTSMaxIndicatedHorsepower ( 1840hp )
    ORTSSuperheatCutoffPressureFactor ( 36.5 )

Comment ( ********************************* Fire ***********************************************
                      Included in this section - Fuel Quality, Grate Area, Shoveling Rate, etc
         ************************************************************************************** )

    ORTSGrateArea ( 29.4ft^2 )
    SteamFiremanMaxPossibleFiringRate( 3000 )
    ShovelCoalMass ( 12lb )

    ORTSFuelCalorific ( 14350btu/lb ) Comment ( Markham coal )
    ORTSBurnRate( 0 170  6000 620  8000 800  10000 1000  12000 1220  14000 1470  16000 1760  18000 2040   20000 2360   22000 2740  24000 3200  26000 3800  27000 4300  28000 5000  28400 6000 ) Comment ( Markham Coal )

Comment ( ********************************* Fuel ******************
                      Included in this section - Coal, water, etc
         ********************************************************** )

    MaxTenderCoalMass ( 6t-uk )
    MaxTenderWaterMass ( 40000lb )
    IsTenderRequired ( 1 )
    ORTSWaterScoopFillElevation ( 3.20m )
    ORTSWaterScoopDepth ( 2.5in )
    ORTSWaterScoopWidth ( 11.875in )

Comment ( ************************* Gearing (If used) ******************
                      Included in this section - Gear type, ratio, etc
         ************************************************************** )

Comment ( *************************** Brake System *********************************************
                      Included in this section - Compressor, Reservoir, Application rates, etc
         ************************************************************************************** )

Comment( *** Braking systems *** )
    BrakesTrainBrakeType( vacuum_single_pipe )
    ORTSBrakePipeTimeFactor ( 0.03s )
    TrainPipeLeakRate ( 0.01inHg/s )
    VacuumBrakesHasVacuumPump ( 1 )

Comment ( *** Ejectors *** )
Comment ( * Estimate for GWR 4 cone ejector * )
    ORTSBrakePipeChargingRate ( 0.56inHg/s )
    VacuumBrakesLargeEjectorUsageRate ( 1320lb/h )
    VacuumBrakesSmallEjectorUsageRate ( 440lb/h )
    VacuumBrakesMinBoilerPressureMaxVacuum ( 120psi )

Comment ( *** Brake Valve Combined *** )
    TrainBrakesControllerMaxSystemPressure ( 25InHg ) Comment ( * GWR operate 25in Hg * )
    ORTSBrakeEmergencyTimeFactor ( 5s )
 
Comment ( ******************* Train Control Systems (If used) ***********************************************
                      Included in this section - Monitoring of Overspeed, Emergency Braking, Vigilance, etc
         *************************************************************************************************** )
Comment ( ** GWR ATC to be added when working in ORTS ** )

Comment ( ************************** Engine Controls **********************************************
                      Included in this section - Controllers for Regulator, Reverser, Brakes, etc
         ***************************************************************************************** )

EngineControllers (

 Regulator ( 0 1 0.025 0  NumNotches( 0 ))
 
 Cutoff    ( -0.75 0.75 0.01 0 NumNotches( 0 ))
           
Comment ( Based upon GWR 4-cone ejector and control valve )
Brake_Train ( 0 1 0.25 0
NumNotches( 2
Notch(0    0 TrainBrakesControllerReleaseStart )
Notch(0.2  1 TrainBrakesControllerVacuumApplyContinuousServiceStart ) ) )

ORTSLargeEjector ( 0 1 0.25 0.0 NumNotches ( 0 ) )

ORTSSmallEjector ( 0 1 0.1 0.0 NumNotches ( 0 ) )

 FireDoor ( 0 1 0.2 0 NumNotches( 0 ))
 Sanding( 0 1 0 )
 Blower ( 0 1 0.05 0.2 NumNotches( 0 ))
 HeatingTap ( 0 1 0.1 0 NumNotches( 0 ))
 Shovel ( 0 1 1 0 NumNotches( 0 ))
 DampersFront ( 0 1 0.1 1 NumNotches( 0 ))
 DampersBack ( 0 1 0.1 0 NumNotches( 0 ))
 Injector1Steam ( 0 1 0 )
 Injector2Steam ( 0 1 1 )
 Injector1Water ( 0 1 0.25 0 NumNotches( 0 ))
 Injector2Water ( 0 1 0.25 0.5 NumNotches( 0 ))
 CylinderCocks ( 0 1 1 )
 Whistle ( 0 1 0 )
 WaterScoop ( 0 1 0 ))

Comment ( ********************** Micellaneous Information ****************************
                      Included in this section - Alternate Views, Sounds, Names, etc
         **************************************************************************** )

 CabView ( "../../common.cab/manor/Manor.cvf" )
 HeadOut (  1.375 3.1 -5.5 )
     Sound ("..\\..\\common.sound\\SteamSoundsOrgUk\\GWR-Manor-Int-100a-01.sms" )
     Name ( "BR Castle 5055 Earl of Eldon" )

Comment ( ************************* Stock Description *****************************************
                      Included in this section - Stock Description, Operating Procedures, etc
         ************************************************************************************* )

  Description (
  ""

 )
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key several times to move the Reverser to full Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the D key to increase the Regulator setting.\n"+  
 "4. As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the Regulator to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
 "2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
 "2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key several times to move the Reverser to the full Reverse position.\n"+
 "4. Press the ; (SEMICOLON) key to release the brakes.\n"+
 "5. Slowly advance the regulator (D key).\n\n"+
 "To load and unload passengers\n"+
 "1. Stop at a station.\n"+
 "2. Press the ENTER key.\n"+
 "3. Wait for the \"permission to depart\" whistle.\n"+
 "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window.\n\n"+
 "Firing commands (Automatic Fireman OFF in Options screen)\n"+
 "To add coal to the firebox\n"+
 "1. Press the F key to open the Firebox door.\n"+
 "2. Press the R key to increase the shoveling rate.\n\n"+
 "To stop adding coal to the fire\n"+
 "1. Press SHIFT+R to decrease the shoveling rate.\n"+
 "2. Press SHIFT+F to close the firebox door.\n\n"+
 "To operate the blower\n"+
 "1. Press the N key to increase the blower.\n"+
 "2. Press SHIFT+N to decrease the blower.\n\n"+
 "To operate the dampers\n"+
 "1. Press the M key to open the dampers.\n"+
 "2. Press SHIFT+M to close the dampers.\n\n"+
 "To inject water into the boiler\n"+
 "1. Press the I key to turn on the steam to Injector 1.\n"+
 "(You can also press the O key to turn on the steam to Injector 2.)\n"+
 "2. Press the K key to increase the water flow to Injector 1.\n"+
 "(To increase the water flow to Injector 2, press the L key.)\n\n"+
 "To stop boiler water injection\n"+ 
 "1. Press the I key to turn off the steam to Injector 1.\n"+
 "2. Press the O key to turn off the steam to Injector 2."
 )
)